{
  "ACTIVE-ACTIVE_АРХИТЕКТУРА": "Способ построения информационной системы, при которой часть трафика, обрабатывавшаяся отказавшим узлом, перенаправляется какому-либо работающему узлу или распределяется между несколькими работающими узлами. Такая схема используется в случае, когда узлы имеют однородную конфигурацию программного обеспечения и выполняют одинаковую задачу.",
  "DBAAS": "Облачный подход к хранению и управлению структурированными данными. DBaaS является многопользовательским и масштабируемым, а функциональность СУБД администрируется силами облачного провайдера.",
  "FAAS": "Архитектурный шаблон, предполагающий возможность вызова экземпляра управляющего кода без необходимости управления серверами и серверным приложением; ключевой компонент бессерверных вычислений.",
  "IAAS": "Одна из моделей обслуживания в облачных вычислениях, по которой потребителям предоставляются по подписке фундаментальные информационно-технологические ресурсы — виртуальные серверы с заданной вычислительной мощностью, операционной системой (чаще всего — предустановленной провайдером из шаблона) и доступом к сети.",
  "PAAS": "Модель предоставления облачных вычислений, при которой потребитель получает доступ к использованию информационно-технологических платформ: операционных систем, систем управления базами данных, связующему программному обеспечению, средствам разработки и тестирования, размещённым у провайдера.",
  "SAAS": "Одна из форм облачных вычислений, модель обслуживания, при которой подписчикам предоставляется готовое прикладное программное обеспечение, полностью обслуживаемое провайдером.",
  "SOA": "Модульный подход к разработке программного обеспечения, базирующийся на обеспечении удаленного по стандартизированным протоколам использования распределённых, слабо связанных легко заменяемых компонентов (сервисов) со стандартизированными интерфейсами.",
  "БЕССЕРВЕРНЫЕ_ВЫЧИСЛЕНИЯ": "Сстратегия организации платформенных облачных услуг, при которой облако автоматически и динамически управляет выделением вычислительных ресурсов в зависимости от пользовательской нагрузки.",
  "ВИРУТАЛЬНАЯ_МАШИНА": "Программная и/или аппаратная система, эмулирующая аппаратное обеспечение некоторой платформы (guest — гостевая платформа) и исполняющая программы для guest-платформы на host-платформе (host — хост-платформа, платформа-хозяин) или виртуализирующая некоторую платформу и создающая на ней среды, изолирующие друг от друга программы и даже операционные системы; также спецификация некоторой вычислительной среды (например: «виртуальная машина языка программирования Си»).",
  "ВЫЧИСЛИТЕЛЬНЫЕ_РЕСУРСЫ": "Возможности, обеспечиваемые компонентами вычислительной системы, расходуемые (занимаемые) в процессе её работы.",
  "МАСШТАБИРУЕМОСТЬ": "Способность системы, сети или процесса справляться с увеличением рабочей нагрузки (увеличивать свою производительность) при добавлении ресурсов (обычно аппаратных).",
  "МУЛЬТИОБЛАЧНАЯ_ИНФОРМАЦИОННАЯ_СИСТЕМА": "Информационная система, вычислительные ресурсы которой расположены сразу на нескольких облачных платформах.",
  "МУЛЬТИРЕГИОНАЛЬНАЯ_ИНФОРМАЦИОННАЯ_СИСТЕМА": "Информационная система, вычислительные ресурсы которой расположены сразу в нескольких регионах облачной платформы. В общем случае, не обязательно, чтобы инфораструктура в регионах работала одновременно.",
  "ОБЛАКО": "Тип распределённых систем, состоящий из набора взаимосвязанных виртуальных машин, которые динамически группируются и представляются в виде одного или более объединенных вычислительных ресурса, отвечающих  соглашению об уровне услуг между провайдером и потребителем.",
  "ОБЛАЧНАЯ_ПЛАТФОРМА": "Платформа для облачных вычислений, представляющая собой готовое программное и аппаратное обеспечение, сдающееся в аренду через Интернет для развертывания, разработки, тестирования своих приложений.",
  "ОТКАЗОУСТОЙЧИВОСТЬ": "Способ обеспечения бесперебойной работы системы и минимизации или предотвращения потери данных в случае компьютерного сбоя.",
  "РАСПРЕДЕЛЕННАЯ_СИСТЕМА": "Система, в которой обработка информации сосредоточена не на одной вычислительной машине, а распределена между несколькими компьютерами.",
  "РАСПРЕДЕЛЕННЫЕ_ВЫЧИСЛЕНИЯ": "Способ решения трудоёмких вычислительных задач с использованием нескольких компьютеров, чаще всего объединённых в параллельную вычислительную систему.",
  "ТУМАННЫЕ_ВЫЧИСЛЕНИЯ": "Разновидность архитектуры вычислений горизонтального типа, используемая для выполнения объемных вычислений, хранения и обработки данных внутри сети облачных сервисов и конечных устройств локально и через Интернет."
}
